---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.HostFlagAreaOn
source: html/c461d59e-f416-8b18-758b-806f84126c7b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.HostFlagAreaOn Property

The Area Reinforcement element was created in a document with the Host Structural Rebar setting on, and cannot be transferred into this document, which has the setting off.

## Syntax (C#)
```csharp
public static FailureDefinitionId HostFlagAreaOn { get; }
```